English/NewWords/TheBigBangS5-5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>S05.05</title>
<!-- 2013-05-29 三 23:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="visayafan"/>
</head>
<body>
<div id="preamble" class="status">
<div id="org-div-comments"><a href="../../index.html#english">主页</a></div>
</div>
<div id="content">
<h1 class="title">S05.05</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. All systems go, if you catch my drift</a></li>
<li><a href="#sec-2">2. Something is obviously bugging you. What is it?</a></li>
<li><a href="#sec-3">3. I just can't believe you signed up the space program without even talking to me.</a></li>
<li><a href="#sec-4">4. Bernadette, an opportunit has come up that impacts both of us, and I'd like to discuss it.</a></li>
<li><a href="#sec-5">5. I've been offer a chance to go up to Internation Space Station for three weeks. What are your thoughts on that?</a></li>
<li><a href="#sec-6">6. If going to space means that much to you, I'll never say another word about it.</a></li>
<li><a href="#sec-7">7. Over my dead body my son goes into outer space.</a></li>
<li><a href="#sec-8">8. with all my heart.</a></li>
<li><a href="#sec-9">9. behind my back</a></li>
<li><a href="#sec-10">10. I just did what I did because I love you so much, and the thought of losing you is more that I can handle.</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> All systems go, if you catch my drift</h2>
<div class="outline-text-2" id="text-1">
<p>
all systems go 各系统准备就绪、一切正常、万事具备
catch my drift 听懂我说的话
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Something is obviously bugging you. What is it?</h2>
<div class="outline-text-2" id="text-2">
<p>
bug 困扰
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> I just can't believe you signed up the space program without even talking to me.</h2>
<div class="outline-text-2" id="text-3">
<p>
without doing sth
without even doing 甚至没有做某件事
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Bernadette, an opportunit has come up that impacts both of us, and I'd like to discuss it.</h2>
<div class="outline-text-2" id="text-4">
<p>
an opportunity has come up 机会来了
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> I've been offer a chance to go up to Internation Space Station for three weeks. What are your thoughts on that?</h2>
<div class="outline-text-2" id="text-5">
<p>
be offered an chance 被给了个机会
What are your thoughts on that? =&gt;What do you think about it? 你怎么想的
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> If going to space means that much to you, I'll never say another word about it.</h2>
<div class="outline-text-2" id="text-6">
<p>
say another word about it.不会反对
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Over my dead body my son goes into outer space.</h2>
<div class="outline-text-2" id="text-7">
<p>
我死也不会让我儿子去外太空的。
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> with all my heart.</h2>
<div class="outline-text-2" id="text-8">
<p>
真心的
</p>
</div>
</div>

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> behind my back</h2>
<div class="outline-text-2" id="text-9">
<p>
背着我
</p>
</div>
</div>

<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> I just did what I did because I love you so much, and the thought of losing you is more that I can handle.</h2>
<div class="outline-text-2" id="text-10">
<p>
more than I can handle. 我承受不来。
</p>
</div>
</div>
</div>
</body>
</html>
